---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.Dispose
source: html/bdb0d5dd-bee1-23e9-6bca-ebf29f38c3eb.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.Dispose Method

Releases all resources used by the IFCExtrusionCreationData

## Syntax (C#)
```csharp
public void Dispose()
```